{
  "updated": "2026-02-24T05:03:44Z",
  "items": [
    {
      "id": "595",
      "title": "Toncoin Outperforms as Crypto Markets Face Broad Selloff",
      "url": "/news/595-toncoin-outperforms-as-crypto-markets-face-broad-selloff/",
      "published_at": "2026-02-24T05:03:44Z",
      "excerpt": "Toncoin (TON) has attracted attention today as its price climbs higher, standing out against a backdrop of declines across the wider crypto market. TON’s strong momentum is in sharp contrast to the losses experienced by…"
    },
    {
      "id": "594",
      "title": "Hamster Kombat Daily Cipher for 23 February 2026 arrives for players",
      "url": "/news/594-hamster-kombat-daily-cipher-for-23-february-2026-arrives-for-players/",
      "published_at": "2026-02-24T02:07:54Z",
      "excerpt": "Details about the Hamster Kombat Daily Cipher for 23 February 2026 have been released. Fans of the game can now look forward to another round of puzzles and in-game challenges set for this date. Every day, Hamster Kombat…"
    },
    {
      "id": "576",
      "title": "The Open Network Looks to One Billion Users for Web3 Growth",
      "url": "/news/576-the-open-network-looks-to-one-billion-users-for-web3-growth/",
      "published_at": "2026-02-23T14:07:08Z",
      "excerpt": "The Open Network (TON) is aiming to drive Web3 adoption by making its ecosystem accessible to a worldwide audience. Leveraging its extensive user base, the project hopes to accelerate the next phase of internet developme…"
    },
    {
      "id": "593",
      "title": "Last 100 Million BlockDAG Tokens Set to Release Before March 4 Spot Trading",
      "url": "/news/593-last-100-million-blockdag-tokens-set-to-release-before-march-4-spot-tr/",
      "published_at": "2026-02-23T11:03:26Z",
      "excerpt": "Interest in the BlockDAG project has soared, especially among investors who previously backed Toncoin and Chainlink. The much-anticipated final allocation of 100 million BlockDAG tokens is about to be released, drawing s…"
    },
    {
      "id": "583",
      "title": "Blazpay Kicks Off 2026 Crypto Presale Amid Toncoin Market Buzz",
      "url": "/news/583-blazpay-kicks-off-2026-crypto-presale-amid-toncoin-market-buzz/",
      "published_at": "2026-02-23T08:06:38Z",
      "excerpt": "Blazpay has launched its 2026 presale campaign, capturing attention within the digital asset space. The move comes at a time when Toncoin’s future price trajectory is rapidly becoming a topic of interest among crypto wat…"
    },
    {
      "id": "591",
      "title": "Hamster Kombat Daily Cipher for February 23, 2026: Solve the Challenge and Earn HMSTR Coins",
      "url": "/news/591-hamster-kombat-daily-cipher-for-february-23-2026-solve-the-challenge-a/",
      "published_at": "2026-02-23T05:02:22Z",
      "excerpt": "Hamster Kombat fans have a new puzzle to tackle for February 23, 2026. The latest daily cipher is now live, inviting players to put their code-breaking skills to the test for a chance to earn free HMSTR coins. This daily…"
    },
    {
      "id": "592",
      "title": "Tomarket Daily Combo Opens Up Free $TOMA Token Claims for February 23, 2026",
      "url": "/news/592-tomarket-daily-combo-opens-up-free-toma-token-claims-for-february-23-2/",
      "published_at": "2026-02-23T02:02:54Z",
      "excerpt": "Tomarket is drawing attention today with the launch of its newest Daily Combo event, offering users a chance to claim free $TOMA tokens. Scheduled for February 23, 2026, this opportunity is generating excitement among co…"
    },
    {
      "id": "585",
      "title": "Toncoin Price Prediction Eyes $10 Mark in 2026–2030 Outlook",
      "url": "/news/585-toncoin-price-prediction-eyes-10-mark-in-20262030-outlook/",
      "published_at": "2026-02-22T14:05:54Z",
      "excerpt": "Interest in Toncoin’s potential continues to grow, with analysts focusing on a significant price goal: reaching $10. Looking ahead to the period between 2026 and 2030, the market is considering what could be in store for…"
    },
    {
      "id": "590",
      "title": "Toncoin Rallies 28% While Market Sentiment Remains Anxious",
      "url": "/news/590-toncoin-rallies-28-while-market-sentiment-remains-anxious/",
      "published_at": "2026-02-22T11:02:53Z",
      "excerpt": "Toncoin (TON) has posted a remarkable 28% gain, climbing higher even as overall sentiment in the crypto market is marked by widespread caution. Despite investors showing notable anxiety and what analysts describe as an a…"
    },
    {
      "id": "589",
      "title": "New Ways to Engage: Tap, Spin, and Evolve for a Chance at the $SPARKY Airdrop",
      "url": "/news/589-new-ways-to-engage-tap-spin-and-evolve-for-a-chance-at-the-sparky-aird/",
      "published_at": "2026-02-22T05:02:33Z",
      "excerpt": "A new interactive campaign has been launched, inviting users to participate in digital activities such as tapping, spinning, and evolving, offering a chance to qualify for the upcoming $SPARKY airdrop. Details about how…"
    },
    {
      "id": "587",
      "title": "Hamster Kombat Cipher for February 22, 2026: Your Chance to Solve and Earn HMSTR",
      "url": "/news/587-hamster-kombat-cipher-for-february-22-2026-your-chance-to-solve-and-ea/",
      "published_at": "2026-02-22T02:02:58Z",
      "excerpt": "Hamster Kombat enthusiasts are back for another day of codebreaking with the daily cipher challenge for February 22, 2026. The game continues to draw players in with a new puzzle that offers the chance to earn free HMSTR…"
    },
    {
      "id": "584",
      "title": "Hamster Kombat Daily Cipher for February 21, 2026 brings another puzzle challenge",
      "url": "/news/584-hamster-kombat-daily-cipher-for-february-21-2026-brings-another-puzzle/",
      "published_at": "2026-02-21T14:03:12Z",
      "excerpt": "Fans of Hamster Kombat who enjoy testing their puzzle-solving abilities have a fresh cipher to decode today. The daily cipher challenge for February 21, 2026, is now available, offering an interactive way for players to…"
    },
    {
      "id": "581",
      "title": "Tapswap Postpones Token Generation Event Due to Market Volatility",
      "url": "/news/581-tapswap-postpones-token-generation-event-due-to-market-volatility/",
      "published_at": "2026-02-21T11:06:22Z",
      "excerpt": "Tapswap has decided to postpone its planned Token Generation Event, citing current market uncertainties as the main reason for the delay. The platform, known for its work in Web3 and crypto-based applications, did not an…"
    },
    {
      "id": "582",
      "title": "Telegram Eyes Expanded Use of TON Blockchain for Tokenized Emojis and Stickers",
      "url": "/news/582-telegram-eyes-expanded-use-of-ton-blockchain-for-tokenized-emojis-and/",
      "published_at": "2026-02-21T08:03:14Z",
      "excerpt": "Telegram has announced plans to deepen its integration with the TON blockchain, with a special focus on bringing tokenized emojis and stickers to its platform. This move signals the messaging service’s continued commitme…"
    },
    {
      "id": "580",
      "title": "AddTon Debuts AddLabs for TON-Based Smart Contract and App Development",
      "url": "/news/580-addton-debuts-addlabs-for-ton-based-smart-contract-and-app-development/",
      "published_at": "2026-02-21T05:02:31Z",
      "excerpt": "AddTon has launched AddLabs, a development platform designed for building smart contracts and applications within the TON ecosystem. This new platform is aimed at both newcomers and experienced developers who want to exp…"
    },
    {
      "id": "577",
      "title": "Toncoin Set for Discussion in Upcoming “Real Talk” Session on 20 February 2026",
      "url": "/news/577-toncoin-set-for-discussion-in-upcoming-real-talk-session-on-20-februar/",
      "published_at": "2026-02-21T02:02:43Z",
      "excerpt": "Toncoin is about to take center stage in an upcoming discussion titled “Real Talk,” scheduled for 20 February 2026. This event is expected to provide insights or analysis related to Toncoin, a digital asset that continue…"
    },
    {
      "id": "569",
      "title": "Toncoin Introduces Fresh AppKit Features Slated for Early May 2026",
      "url": "/news/569-toncoin-introduces-fresh-appkit-features-slated-for-early-may-2026/",
      "published_at": "2026-02-20T14:06:47Z",
      "excerpt": "Toncoin has announced new developments for its AppKit, with a set of updates scheduled to arrive on May 1, 2026. This addition is intended to enhance functionality for both users and developers building on the Toncoin pl…"
    },
    {
      "id": "570",
      "title": "Toncoin Price Forecast Highlights a Potential $30 Target by 2030",
      "url": "/news/570-toncoin-price-forecast-highlights-a-potential-30-target-by-2030/",
      "published_at": "2026-02-20T11:06:48Z",
      "excerpt": "A recent outlook on Toncoin has focused attention on its long-term prospects, with a potential price goal of $30 suggested for the year 2030. The analysis, reportedly by a financial entity, reflects growing curiosity abo…"
    },
    {
      "id": "572",
      "title": "Tomarket Daily Combo Offers Free $TOMA Token Claim on February 20, 2026",
      "url": "/news/572-tomarket-daily-combo-offers-free-toma-token-claim-on-february-20-2026/",
      "published_at": "2026-02-20T08:02:29Z",
      "excerpt": "Tomarket has announced its Daily Combo for February 20, 2026, giving users the opportunity to claim $TOMA tokens for free. This promotion appears to feature instant token distribution, making it an appealing offer for th…"
    },
    {
      "id": "571",
      "title": "Hamster Kombat Daily Combo Offers 5 Million Coins on February 20, 2026",
      "url": "/news/571-hamster-kombat-daily-combo-offers-5-million-coins-on-february-20-2026/",
      "published_at": "2026-02-20T05:02:53Z",
      "excerpt": "Hamster Kombat enthusiasts have something to look forward to on February 20, 2026, as a special in-game event brings a massive pool of 5 million coins up for grabs. Players are reporting heightened activity as they rush…"
    },
    {
      "id": "568",
      "title": "Ton Blockchain Improves AppKit and Announces Toncoin Livestream on February 20",
      "url": "/news/568-ton-blockchain-improves-appkit-and-announces-toncoin-livestream-on-feb/",
      "published_at": "2026-02-20T02:03:35Z",
      "excerpt": "The Ton blockchain ecosystem has rolled out an update to its AppKit, highlighting its ongoing commitment to enhancing developer tools. With this initiative, the platform seeks to streamline the app creation process and i…"
    },
    {
      "id": "565",
      "title": "Reports Suggest Alexei Navalny Was Poisoned With Deadly Frog Toxin",
      "url": "/news/565-reports-suggest-alexei-navalny-was-poisoned-with-deadly-frog-toxin/",
      "published_at": "2026-02-19T14:07:58Z",
      "excerpt": "Questions continue to swirl around the recent death of Russian opposition leader Alexei Navalny, with speculation increasing about how it happened and what exactly caused it. A new analysis by chemical weapons expert Mar…"
    },
    {
      "id": "561",
      "title": "Tomarket Daily Combo Offers Free $TOMA Tokens for February 19, 2026",
      "url": "/news/561-tomarket-daily-combo-offers-free-toma-tokens-for-february-19-2026/",
      "published_at": "2026-02-19T11:02:57Z",
      "excerpt": "Details for the Tomarket Daily Combo promotion on February 19, 2026, have emerged, highlighting an opportunity for participants to claim free $TOMA tokens. The information available points to a special giveaway, but spec…"
    },
    {
      "id": "558",
      "title": "TON Foundation teams up with Banxa to boost stablecoin payments for Asia-Pacific businesses",
      "url": "/news/558-ton-foundation-teams-up-with-banxa-to-boost-stablecoin-payments-for-as/",
      "published_at": "2026-02-19T08:03:23Z",
      "excerpt": "The TON Foundation has announced a new partnership with Banxa, a payments firm associated with OSL, to strengthen the use of stablecoins for merchant payments in the Asia-Pacific region. This collaboration is designed to…"
    },
    {
      "id": "556",
      "title": "TON Foundation Partners With Banxa to Enhance Stablecoin Availability Across Asia-Pacific",
      "url": "/news/556-ton-foundation-partners-with-banxa-to-enhance-stablecoin-availability/",
      "published_at": "2026-02-19T05:08:32Z",
      "excerpt": "The TON Foundation has announced a new partnership with Banxa aimed at making stablecoins more accessible in the Asia-Pacific region. This collaboration seeks to simplify the process for users in the area who want to obt…"
    },
    {
      "id": "553",
      "title": "Hamster Kombat Features Daily Combo for February 18: Play to Earn Update",
      "url": "/news/553-hamster-kombat-features-daily-combo-for-february-18-play-to-earn-updat/",
      "published_at": "2026-02-19T02:03:19Z",
      "excerpt": "Fans of Hamster Kombat continue to follow the Play to Earn campaign as the game releases its daily combo for February 18, 2026. The details of today's combo drop have not been confirmed, but many players are tracking the…"
    },
    {
      "id": "549",
      "title": "TON Foundation teams up with Banxa to boost stablecoin payments for Asia-Pacific merchants",
      "url": "/news/549-ton-foundation-teams-up-with-banxa-to-boost-stablecoin-payments-for-as/",
      "published_at": "2026-02-18T14:02:50Z",
      "excerpt": "The TON Foundation is partnering with Banxa, a digital payments provider under OSL, to advance the use of stablecoins in the Asia-Pacific region. This collaboration aims to make it easier for merchants in the area to acc…"
    },
    {
      "id": "547",
      "title": "TON Foundation teams up with Banxa to expand stablecoin payments in APAC",
      "url": "/news/547-ton-foundation-teams-up-with-banxa-to-expand-stablecoin-payments-in-ap/",
      "published_at": "2026-02-18T11:02:38Z",
      "excerpt": "The TON Foundation has announced a new partnership with Banxa, a payments infrastructure provider, aiming to boost the use of stablecoin payments across the Asia-Pacific (APAC) region. Through this collaboration, users a…"
    },
    {
      "id": "506",
      "title": "TON Wallet in Telegram Introduces Cross-Chain Deposit Feature",
      "url": "/news/506-ton-wallet-in-telegram-introduces-cross-chain-deposit-feature/",
      "published_at": "2026-02-18T08:07:57Z",
      "excerpt": "TON Wallet, integrated within the popular messaging platform Telegram, has launched a new feature supporting cross-chain deposits. This development enables users to transfer assets from multiple blockchain networks into…"
    },
    {
      "id": "509",
      "title": "Tomarket Offers Free $TOMA Tokens in Daily Combo for February 14, 2026",
      "url": "/news/509-tomarket-offers-free-toma-tokens-in-daily-combo-for-february-14-2026/",
      "published_at": "2026-02-18T05:07:15Z",
      "excerpt": "Tomarket is inviting users to join its Daily Combo promotion on February 14, 2026, presenting a chance to claim free $TOMA tokens. This offer appears to be available for a limited time, encouraging crypto enthusiasts to…"
    },
    {
      "id": "544",
      "title": "Hamster Kombat Daily Cipher for February 17, 2026: Solve Today’s Puzzle for Free Coins",
      "url": "/news/544-hamster-kombat-daily-cipher-for-february-17-2026-solve-todays-puzzle-f/",
      "published_at": "2026-02-18T02:06:19Z",
      "excerpt": "Each day brings a new challenge for Hamster Kombat players, and February 17, 2026, is no different. The popular game continues its tradition of presenting a “Daily Cipher,” giving the community an engaging puzzle to solv…"
    },
    {
      "id": "507",
      "title": "TON Wallet in Telegram Adds Wrapped Bitcoin and Ethereum Support",
      "url": "/news/507-ton-wallet-in-telegram-adds-wrapped-bitcoin-and-ethereum-support/",
      "published_at": "2026-02-17T14:07:08Z",
      "excerpt": "Users of the wallet integrated within Telegram now have broader crypto options at their fingertips. The TON Wallet, previously focused on native TON tokens, has expanded its capabilities to support wrapped versions of bo…"
    },
    {
      "id": "542",
      "title": "Tomarket Offers Daily Promo With Instant $TOMA Token Claims on February 17, 2026",
      "url": "/news/542-tomarket-offers-daily-promo-with-instant-toma-token-claims-on-february/",
      "published_at": "2026-02-17T11:02:56Z",
      "excerpt": "Tomarket has introduced a special daily combo event for February 17, 2026, giving users the chance to instantly claim free $TOMA tokens. While the campaign appears to be open to participants today, the exact mechanics an…"
    },
    {
      "id": "538",
      "title": "Cardano, DeepSnitch AI, and Toncoin Spark Interest with 2026 Price Predictions",
      "url": "/news/538-cardano-deepsnitch-ai-and-toncoin-spark-interest-with-2026-price-predi/",
      "published_at": "2026-02-17T08:08:27Z",
      "excerpt": "Excitement continues to grow in the cryptocurrency community as the outlook for Cardano (ADA), DeepSnitch AI, and Toncoin is brought into focus for 2026. Forecasters and market watchers are examining how each project’s f…"
    },
    {
      "id": "541",
      "title": "TON Wallet Brings Cross-Chain Deposits, Streamlining Crypto Transfers",
      "url": "/news/541-ton-wallet-brings-cross-chain-deposits-streamlining-crypto-transfers/",
      "published_at": "2026-02-17T05:01:55Z",
      "excerpt": "TON Wallet has introduced a new feature enabling cross-chain deposits, aiming to make it easier for users to fund their accounts with assets from different blockchains. This update is designed to simplify the process of…"
    },
    {
      "id": "540",
      "title": "Hamster Kombat Daily Cipher Arrives for 17 February 2026",
      "url": "/news/540-hamster-kombat-daily-cipher-arrives-for-17-february-2026/",
      "published_at": "2026-02-17T02:03:08Z",
      "excerpt": "A new daily puzzle is available for Hamster Kombat fans on 17 February 2026, inviting players to tackle the latest cipher challenge. The game, famous for its engaging ciphers, continues to attract a dedicated community e…"
    },
    {
      "id": "531",
      "title": "Hamster Kombat Offers 5 Million Coins in Latest Daily Combo Event",
      "url": "/news/531-hamster-kombat-offers-5-million-coins-in-latest-daily-combo-event/",
      "published_at": "2026-02-16T14:01:39Z",
      "excerpt": "Players of Hamster Kombat are jumping into the newest Daily Combo challenge today, with a tempting 5 million coins said to be available for participants. The event, announced for February 15, 2026, has created a buzz amo…"
    },
    {
      "id": "537",
      "title": "Top Toncoin (TON) Wallets to Consider in 2026",
      "url": "/news/537-top-toncoin-ton-wallets-to-consider-in-2026/",
      "published_at": "2026-02-16T11:02:49Z",
      "excerpt": "A variety of digital wallets is emerging for Toncoin (TON) users ahead of 2026, reflecting the growing interest in secure and convenient methods for storing and managing TON tokens. As demand rises, users are increasingl…"
    },
    {
      "id": "532",
      "title": "A Fresh Look at Telegram Mini Apps: What They Offer and Where They Fall Short",
      "url": "/news/532-a-fresh-look-at-telegram-mini-apps-what-they-offer-and-where-they-fall/",
      "published_at": "2026-02-16T08:01:37Z",
      "excerpt": "Telegram Mini Apps are becoming a notable feature for users and developers interested in extending messaging platforms beyond simple chat. These lightweight applications can run within the Telegram environment, providing…"
    },
    {
      "id": "536",
      "title": "Toncoin Review for 2026: Adoption Milestones, Tokenomics, and Network Challenges",
      "url": "/news/536-toncoin-review-for-2026-adoption-milestones-tokenomics-and-network-cha/",
      "published_at": "2026-02-16T05:02:07Z",
      "excerpt": "Toncoin (TON) continues to attract attention in the crypto world, especially as 2026 unfolds. The network’s integration with popular messaging apps has played a significant role in raising its profile. Many users are dra…"
    },
    {
      "id": "535",
      "title": "BlockDAG Mainnet Launch Draws Attention as BNB and Toncoin See Slowdown",
      "url": "/news/535-blockdag-mainnet-launch-draws-attention-as-bnb-and-toncoin-see-slowdow/",
      "published_at": "2026-02-16T02:02:33Z",
      "excerpt": "BlockDAG, a new participant in the blockchain industry, has officially launched its mainnet, sparking considerable discussion among digital asset communities. This event comes at a time when established cryptocurrencies…"
    },
    {
      "id": "534",
      "title": "Toncoin’s Position in 2026: Adoption, Tokenomics and Ongoing Network Challenges",
      "url": "/news/534-toncoins-position-in-2026-adoption-tokenomics-and-ongoing-network-chal/",
      "published_at": "2026-02-15T14:02:49Z",
      "excerpt": "Toncoin (TON) has remained a prominent player in the crypto world as 2026 unfolds, largely thanks to its integration with widely used social platforms. By taking advantage of its broad adoption, Toncoin has maintained an…"
    },
    {
      "id": "533",
      "title": "Self-Custodial TON Wallet Introduces Cross-Chain Deposit Feature",
      "url": "/news/533-self-custodial-ton-wallet-introduces-cross-chain-deposit-feature/",
      "published_at": "2026-02-15T11:02:07Z",
      "excerpt": "A new update has been rolled out for the self-custodial wallet linked to the TON ecosystem, making it easier for users to manage assets across different blockchains. This feature now allows users to deposit tokens from v…"
    },
    {
      "id": "529",
      "title": "Toncoin price activity slows as token trades near key $1.50 threshold",
      "url": "/news/529-toncoin-price-activity-slows-as-token-trades-near-key-150-threshold/",
      "published_at": "2026-02-15T08:07:24Z",
      "excerpt": "Toncoin has recently seen its price hovering close to the $1.50 mark, drawing attention from market watchers interested in how the cryptocurrency will move next. The token has yet to make any definitive push above or bel…"
    },
    {
      "id": "530",
      "title": "Tomarket Launches Daily Combo Event on February 15, 2026 With $TOMA Token Claim",
      "url": "/news/530-tomarket-launches-daily-combo-event-on-february-15-2026-with-toma-toke/",
      "published_at": "2026-02-15T05:06:41Z",
      "excerpt": "Tomarket has introduced its latest Daily Combo event for February 15, 2026, giving users a chance to claim free $TOMA tokens. This limited-time event is designed to engage the community and increase participation on the…"
    },
    {
      "id": "528",
      "title": "Hamster Kombat Daily Cipher for 15 February 2026 launches new play event",
      "url": "/news/528-hamster-kombat-daily-cipher-for-15-february-2026-launches-new-play-eve/",
      "published_at": "2026-02-15T02:02:35Z",
      "excerpt": "The Hamster Kombat team has introduced its latest Daily Cipher challenge for 15 February 2026, inviting players to take part for a chance to earn in-game rewards. This ongoing initiative is part of Hamster Kombat’s commi…"
    },
    {
      "id": "515",
      "title": "TON Wallet Introduces Wrapped Bitcoin and Ethereum Compatibility",
      "url": "/news/515-ton-wallet-introduces-wrapped-bitcoin-and-ethereum-compatibility/",
      "published_at": "2026-02-14T14:02:08Z",
      "excerpt": "Users of the TON Wallet now have new ways to manage digital assets, as recent updates bring support for wrapped versions of Bitcoin and Ethereum. This expansion allows wallet holders to access wBTC and wETH directly with…"
    },
    {
      "id": "525",
      "title": "Toncoin price outlook in focus as TON trades around the $1.50 mark",
      "url": "/news/525-toncoin-price-outlook-in-focus-as-ton-trades-around-the-150-mark/",
      "published_at": "2026-02-14T11:02:12Z",
      "excerpt": "Toncoin has recently attracted increased market attention as its price remains close to the $1.50 threshold. This price level is often viewed as a significant area by both analysts and traders, who are keeping a close wa…"
    },
    {
      "id": "516",
      "title": "Toncoin (TON) Outlook for 2026: Exchange Access and Fee Information",
      "url": "/news/516-toncoin-ton-outlook-for-2026-exchange-access-and-fee-information/",
      "published_at": "2026-02-14T09:13:11Z",
      "excerpt": "Toncoin (TON) has continued to attract attention as its ecosystem matures, sparking interest in its price outlook for 2026. As more users explore decentralized finance and blockchain-based platforms, understanding where…"
    },
    {
      "id": "518",
      "title": "Toncoin holding steady as TON price tests the $1.50 level",
      "url": "/news/518-toncoin-holding-steady-as-ton-price-tests-the-150-level/",
      "published_at": "2026-02-14T08:45:33Z",
      "excerpt": "Toncoin (TON) has recently attracted attention as it hovers near the significant $1.50 mark. Traders are keeping a close eye on how the cryptocurrency behaves around this price, since it often represents a moment when bu…"
    }
  ]
}