{
  "updated": "2026-03-01T11:02:47Z",
  "items": [
    {
      "id": "649",
      "title": "BlockDAG Faces Doubts as Bitcoin Drops Sharply, Pepeto Sets Bold Target, and Toncoin Seeks",
      "url": "/news/649-blockdag-faces-doubts-as-bitcoin-drops-sharply-pepeto-sets-bold-target/",
      "published_at": "2026-03-01T11:02:47Z",
      "excerpt": "BlockDAG, a blockchain project that has drawn attention for its ambitious price forecasts, is under increased scrutiny as its predictions come under review. Recent conversations in the crypto community have questioned wh…"
    },
    {
      "id": "652",
      "title": "Tomarket Daily Combo: March 2, 2026 Highlights Token Earning Opportunity",
      "url": "/news/652-tomarket-daily-combo-march-2-2026-highlights-token-earning-opportunity/",
      "published_at": "2026-03-01T08:02:54Z",
      "excerpt": "Tomarket has revealed its Daily Combo for March 2, 2026, giving users the chance to take part and potentially earn tokens by interacting with the platform. This initiative builds on Tomarket’s ongoing tradition of offeri…"
    },
    {
      "id": "653",
      "title": "Hamster Kombat Daily Combo Offers 5 Million Coins on March 1, 2026",
      "url": "/news/653-hamster-kombat-daily-combo-offers-5-million-coins-on-march-1-2026/",
      "published_at": "2026-03-01T05:03:35Z",
      "excerpt": "Hamster Kombat fans have a new reason to log in today, as the popular clicker game is offering a daily combo event with a prize pool of 5 million in-game coins. This special event begins on March 1, 2026, and is open to…"
    },
    {
      "id": "650",
      "title": "Toncoin Remains Steady Above $1.27 After Price Slides 15% This Month",
      "url": "/news/650-toncoin-remains-steady-above-127-after-price-slides-15-this-month/",
      "published_at": "2026-03-01T02:03:08Z",
      "excerpt": "Toncoin has managed to maintain a price range between $1.27 and $1.32 even after posting a significant monthly decline. Over the past month, Toncoin’s value has fallen by around 15%, reflecting a turbulent period for the…"
    },
    {
      "id": "644",
      "title": "TON Foundation Rolls Out TON Pay to Simplify Payments Across Its Ecosystem",
      "url": "/news/644-ton-foundation-rolls-out-ton-pay-to-simplify-payments-across-its-ecosy/",
      "published_at": "2026-02-28T14:02:42Z",
      "excerpt": "TON Foundation has introduced TON Pay, a new payment solution aimed at making transactions easier for users and developers within its ecosystem. The initiative is designed to streamline how payments are handled, allowing…"
    },
    {
      "id": "643",
      "title": "TON Wallet Introduces New Interest Options for Bitcoin, Ethereum, and USDT",
      "url": "/news/643-ton-wallet-introduces-new-interest-options-for-bitcoin-ethereum-and-us/",
      "published_at": "2026-02-28T11:02:27Z",
      "excerpt": "TON Wallet has rolled out new features that let users earn interest on major cryptocurrencies, including Bitcoin, Ethereum, and Tether (USDT). While the exact rates and terms have yet to be fully confirmed, this move sho…"
    },
    {
      "id": "640",
      "title": "Hamster Kombat Shares Daily Combo for February 28, 2026",
      "url": "/news/640-hamster-kombat-shares-daily-combo-for-february-28-2026/",
      "published_at": "2026-02-28T08:08:03Z",
      "excerpt": "The popular game Hamster Kombat has released its latest daily combo for players on February 28, 2026. Fans who enjoy new challenges or bonuses will want to check out today’s special sequence. As with previous days, the d…"
    },
    {
      "id": "637",
      "title": "Tomarket Offers Daily Combo With Chance to Claim Free $TOMA Tokens on February 28",
      "url": "/news/637-tomarket-offers-daily-combo-with-chance-to-claim-free-toma-tokens-on-f/",
      "published_at": "2026-02-28T05:03:23Z",
      "excerpt": "Tomarket has announced a new opportunity for users on February 28, 2026, featuring its “Daily Combo” event. During this promotion, participants can instantly claim free $TOMA tokens. The Daily Combo appears to be a recur…"
    },
    {
      "id": "634",
      "title": "TON Wallet Adds BTC, ETH, and USDT Yield Vaults for Users",
      "url": "/news/634-ton-wallet-adds-btc-eth-and-usdt-yield-vaults-for-users/",
      "published_at": "2026-02-28T02:02:22Z",
      "excerpt": "TON Wallet has introduced new features aimed at expanding its capabilities, now allowing users to access yield vaults for Bitcoin (BTC), Ethereum (ETH), and Tether (USDT). This update broadens the range of assets that us…"
    },
    {
      "id": "631",
      "title": "TON Wallet Introduces DeFi Vaults With Yield Opportunities Up to 18% APY",
      "url": "/news/631-ton-wallet-introduces-defi-vaults-with-yield-opportunities-up-to-18-ap/",
      "published_at": "2026-02-27T14:06:23Z",
      "excerpt": "Users of TON Wallet now have a new way to participate in decentralized finance, thanks to the platform's integration of DeFi vaults. This update gives users the opportunity to explore earning options, with reported retur…"
    },
    {
      "id": "628",
      "title": "Toncoin Bears Eye $1.25 Mark as Downward Trends Continue",
      "url": "/news/628-toncoin-bears-eye-125-mark-as-downward-trends-continue/",
      "published_at": "2026-02-27T11:02:32Z",
      "excerpt": "Toncoin continues to face headwinds as bearish sentiment weighs on its price performance. Observers note that ongoing selling pressure has pushed the cryptocurrency closer to a key support level near $1.25. The recent mo…"
    },
    {
      "id": "625",
      "title": "TON Wallet Introduces Yield Options for Bitcoin, Ethereum, and USDT",
      "url": "/news/625-ton-wallet-introduces-yield-options-for-bitcoin-ethereum-and-usdt/",
      "published_at": "2026-02-27T08:03:07Z",
      "excerpt": "TON Wallet, a key product in the TON blockchain ecosystem, has rolled out a new feature that lets users earn yield on their Bitcoin, Ethereum, and USDT holdings. This development brings more established digital assets in…"
    },
    {
      "id": "622",
      "title": "Toncoin Price Dips as Vaults Feature Launches in TON Wallet",
      "url": "/news/622-toncoin-price-dips-as-vaults-feature-launches-in-ton-wallet/",
      "published_at": "2026-02-27T05:07:43Z",
      "excerpt": "Toncoin (TON) has recently experienced a significant price decline, with analysts describing the token as “heavily oversold.” This downturn coincided with the introduction of a new feature called Vaults in the official T…"
    },
    {
      "id": "619",
      "title": "Hamster Kombat Daily Combo for February 27, 2026: What Players Need to Know",
      "url": "/news/619-hamster-kombat-daily-combo-for-february-27-2026-what-players-need-to-k/",
      "published_at": "2026-02-27T02:02:41Z",
      "excerpt": "Players of Hamster Kombat looking forward to the daily combo on February 27, 2026, can expect fresh opportunities in the play-to-earn environment. While the specific combination or challenges set for the day have not yet…"
    },
    {
      "id": "615",
      "title": "TON Wallet Launches New Interest Features for Bitcoin, Ethereum, and USDT",
      "url": "/news/615-ton-wallet-launches-new-interest-features-for-bitcoin-ethereum-and-usd/",
      "published_at": "2026-02-26T14:06:26Z",
      "excerpt": "TON Wallet has introduced a new range of features aimed at giving users greater flexibility with their digital assets. Now, holders of Bitcoin, Ethereum, and USDT can take advantage of interest-earning opportunities dire…"
    },
    {
      "id": "616",
      "title": "TON Wallet Expands Income Options Within Telegram Ecosystem",
      "url": "/news/616-ton-wallet-expands-income-options-within-telegram-ecosystem/",
      "published_at": "2026-02-26T11:03:09Z",
      "excerpt": "TON Wallet has announced a new opportunity for users to earn income directly through Telegram, introducing fresh possibilities within the popular messaging app. This step emphasizes TON Wallet’s commitment to delivering…"
    },
    {
      "id": "612",
      "title": "Toncoin (TON) Eyes Resistance After Bouncing From Support",
      "url": "/news/612-toncoin-ton-eyes-resistance-after-bouncing-from-support/",
      "published_at": "2026-02-26T08:02:14Z",
      "excerpt": "Toncoin (TON) has recently attracted attention as its price rebounded from a significant support level. Now, the digital asset is targeting resistance points that range from $2.65 up to $15. This development follows TON’…"
    },
    {
      "id": "613",
      "title": "Final Hours for BlockDAG’s $0.00125 Direct Sale as Toncoin and Litecoin Show Weakness",
      "url": "/news/613-final-hours-for-blockdags-000125-direct-sale-as-toncoin-and-litecoin-s/",
      "published_at": "2026-02-26T05:02:43Z",
      "excerpt": "BlockDAG is approaching the conclusion of its direct sale event, where the token is priced at $0.00125. Reports indicate that this sale is now in its final hours, marking a significant milestone for the project as it wra…"
    },
    {
      "id": "611",
      "title": "Hamster Kombat Daily Cipher for 26 February 2026 Released",
      "url": "/news/611-hamster-kombat-daily-cipher-for-26-february-2026-released/",
      "published_at": "2026-02-26T02:02:28Z",
      "excerpt": "The Hamster Kombat team has launched the Daily Cipher challenge for 26 February 2026, inviting players to participate for a chance to solve puzzles and advance within the game. This ongoing event continues to attract bot…"
    },
    {
      "id": "557",
      "title": "TON Foundation expands stablecoin payment options for Asian businesses through Banxa",
      "url": "/news/557-ton-foundation-expands-stablecoin-payment-options-for-asian-businesses/",
      "published_at": "2026-02-25T14:01:44Z",
      "excerpt": "The TON Foundation has unveiled a new payment processing solution designed to support stablecoin transactions for businesses operating in Asia. This initiative is being rolled out in collaboration with Banxa, a company k…"
    },
    {
      "id": "604",
      "title": "Toncoin Sees Ongoing Correction as Market Sentiment Turns Bearish",
      "url": "/news/604-toncoin-sees-ongoing-correction-as-market-sentiment-turns-bearish/",
      "published_at": "2026-02-25T11:03:33Z",
      "excerpt": "Toncoin has entered a notable correction phase, with the recent trend suggesting further downward movement. The token has experienced persistent selling pressure, raising questions about where the next large support area…"
    },
    {
      "id": "605",
      "title": "TON to Disable Toncoin Bridge to Ethereum and BNB Smart Chain Starting May 10",
      "url": "/news/605-ton-to-disable-toncoin-bridge-to-ethereum-and-bnb-smart-chain-starting/",
      "published_at": "2026-02-25T08:04:15Z",
      "excerpt": "The TON team has announced that it will discontinue the bridge service that allows users to transfer Toncoin (TON) between the TON blockchain and two major networks: Ethereum and BNB Smart Chain. The bridge will stop ope…"
    },
    {
      "id": "603",
      "title": "Tomarket Offers Instant $TOMA Token Claims in Latest Daily Combo",
      "url": "/news/603-tomarket-offers-instant-toma-token-claims-in-latest-daily-combo/",
      "published_at": "2026-02-25T05:02:33Z",
      "excerpt": "Tomarket has announced a new opportunity for users to claim free $TOMA tokens as part of its Daily Combo event for February 25, 2026. According to the announcement, participants can access and claim their tokens instantl…"
    },
    {
      "id": "600",
      "title": "Hamster Kombat Launches Daily Cipher Challenge for 24 February 2026",
      "url": "/news/600-hamster-kombat-launches-daily-cipher-challenge-for-24-february-2026/",
      "published_at": "2026-02-25T02:09:04Z",
      "excerpt": "Hamster Kombat fans have another opportunity to put their puzzle-solving skills to the test with the launch of the Daily Cipher for February 24, 2026. This recurring feature encourages players to crack the day's unique c…"
    },
    {
      "id": "560",
      "title": "AlphaTON Moves to Sell Cancer Treatment Business Amid Strategic Shift",
      "url": "/news/560-alphaton-moves-to-sell-cancer-treatment-business-amid-strategic-shift/",
      "published_at": "2026-02-24T14:07:24Z",
      "excerpt": "Toncoin-focused treasury firm AlphaTON has reached an agreement to sell its cancer treatment subsidiary, marking a significant shift in the company’s business direction. AlphaTON, best known for managing digital assets r…"
    },
    {
      "id": "566",
      "title": "AlphaTON Set to Divest Cancer Treatment Subsidiary",
      "url": "/news/566-alphaton-set-to-divest-cancer-treatment-subsidiary/",
      "published_at": "2026-02-24T11:06:33Z",
      "excerpt": "Toncoin-oriented treasury firm AlphaTON is moving to divest its cancer treatment subsidiary, according to recent reports. While specifics about the deal—including the identity of the buyer and the terms of the transactio…"
    },
    {
      "id": "575",
      "title": "Five Cryptocurrencies to Watch as Market Trends Shift in 2026",
      "url": "/news/575-five-cryptocurrencies-to-watch-as-market-trends-shift-in-2026/",
      "published_at": "2026-02-24T08:03:42Z",
      "excerpt": "Several cryptocurrencies are drawing attention from the crypto community in 2026 as potential trendsetters in the evolving market. Among the names circulating are Blazpay, Solana, Toncoin, Avalanche, and XRP, all of whic…"
    },
    {
      "id": "595",
      "title": "Toncoin Outperforms as Crypto Markets Face Broad Selloff",
      "url": "/news/595-toncoin-outperforms-as-crypto-markets-face-broad-selloff/",
      "published_at": "2026-02-24T05:03:44Z",
      "excerpt": "Toncoin (TON) has attracted attention today as its price climbs higher, standing out against a backdrop of declines across the wider crypto market. TON’s strong momentum is in sharp contrast to the losses experienced by…"
    },
    {
      "id": "594",
      "title": "Hamster Kombat Daily Cipher for 23 February 2026 arrives for players",
      "url": "/news/594-hamster-kombat-daily-cipher-for-23-february-2026-arrives-for-players/",
      "published_at": "2026-02-24T02:07:54Z",
      "excerpt": "Details about the Hamster Kombat Daily Cipher for 23 February 2026 have been released. Fans of the game can now look forward to another round of puzzles and in-game challenges set for this date. Every day, Hamster Kombat…"
    },
    {
      "id": "576",
      "title": "The Open Network Looks to One Billion Users for Web3 Growth",
      "url": "/news/576-the-open-network-looks-to-one-billion-users-for-web3-growth/",
      "published_at": "2026-02-23T14:07:08Z",
      "excerpt": "The Open Network (TON) is aiming to drive Web3 adoption by making its ecosystem accessible to a worldwide audience. Leveraging its extensive user base, the project hopes to accelerate the next phase of internet developme…"
    },
    {
      "id": "593",
      "title": "Last 100 Million BlockDAG Tokens Set to Release Before March 4 Spot Trading",
      "url": "/news/593-last-100-million-blockdag-tokens-set-to-release-before-march-4-spot-tr/",
      "published_at": "2026-02-23T11:03:26Z",
      "excerpt": "Interest in the BlockDAG project has soared, especially among investors who previously backed Toncoin and Chainlink. The much-anticipated final allocation of 100 million BlockDAG tokens is about to be released, drawing s…"
    },
    {
      "id": "583",
      "title": "Blazpay Kicks Off 2026 Crypto Presale Amid Toncoin Market Buzz",
      "url": "/news/583-blazpay-kicks-off-2026-crypto-presale-amid-toncoin-market-buzz/",
      "published_at": "2026-02-23T08:06:38Z",
      "excerpt": "Blazpay has launched its 2026 presale campaign, capturing attention within the digital asset space. The move comes at a time when Toncoin’s future price trajectory is rapidly becoming a topic of interest among crypto wat…"
    },
    {
      "id": "591",
      "title": "Hamster Kombat Daily Cipher for February 23, 2026: Solve the Challenge and Earn HMSTR Coins",
      "url": "/news/591-hamster-kombat-daily-cipher-for-february-23-2026-solve-the-challenge-a/",
      "published_at": "2026-02-23T05:02:22Z",
      "excerpt": "Hamster Kombat fans have a new puzzle to tackle for February 23, 2026. The latest daily cipher is now live, inviting players to put their code-breaking skills to the test for a chance to earn free HMSTR coins. This daily…"
    },
    {
      "id": "592",
      "title": "Tomarket Daily Combo Opens Up Free $TOMA Token Claims for February 23, 2026",
      "url": "/news/592-tomarket-daily-combo-opens-up-free-toma-token-claims-for-february-23-2/",
      "published_at": "2026-02-23T02:02:54Z",
      "excerpt": "Tomarket is drawing attention today with the launch of its newest Daily Combo event, offering users a chance to claim free $TOMA tokens. Scheduled for February 23, 2026, this opportunity is generating excitement among co…"
    },
    {
      "id": "585",
      "title": "Toncoin Price Prediction Eyes $10 Mark in 2026–2030 Outlook",
      "url": "/news/585-toncoin-price-prediction-eyes-10-mark-in-20262030-outlook/",
      "published_at": "2026-02-22T14:05:54Z",
      "excerpt": "Interest in Toncoin’s potential continues to grow, with analysts focusing on a significant price goal: reaching $10. Looking ahead to the period between 2026 and 2030, the market is considering what could be in store for…"
    },
    {
      "id": "590",
      "title": "Toncoin Rallies 28% While Market Sentiment Remains Anxious",
      "url": "/news/590-toncoin-rallies-28-while-market-sentiment-remains-anxious/",
      "published_at": "2026-02-22T11:02:53Z",
      "excerpt": "Toncoin (TON) has posted a remarkable 28% gain, climbing higher even as overall sentiment in the crypto market is marked by widespread caution. Despite investors showing notable anxiety and what analysts describe as an a…"
    },
    {
      "id": "589",
      "title": "New Ways to Engage: Tap, Spin, and Evolve for a Chance at the $SPARKY Airdrop",
      "url": "/news/589-new-ways-to-engage-tap-spin-and-evolve-for-a-chance-at-the-sparky-aird/",
      "published_at": "2026-02-22T05:02:33Z",
      "excerpt": "A new interactive campaign has been launched, inviting users to participate in digital activities such as tapping, spinning, and evolving, offering a chance to qualify for the upcoming $SPARKY airdrop. Details about how…"
    },
    {
      "id": "587",
      "title": "Hamster Kombat Cipher for February 22, 2026: Your Chance to Solve and Earn HMSTR",
      "url": "/news/587-hamster-kombat-cipher-for-february-22-2026-your-chance-to-solve-and-ea/",
      "published_at": "2026-02-22T02:02:58Z",
      "excerpt": "Hamster Kombat enthusiasts are back for another day of codebreaking with the daily cipher challenge for February 22, 2026. The game continues to draw players in with a new puzzle that offers the chance to earn free HMSTR…"
    },
    {
      "id": "584",
      "title": "Hamster Kombat Daily Cipher for February 21, 2026 brings another puzzle challenge",
      "url": "/news/584-hamster-kombat-daily-cipher-for-february-21-2026-brings-another-puzzle/",
      "published_at": "2026-02-21T14:03:12Z",
      "excerpt": "Fans of Hamster Kombat who enjoy testing their puzzle-solving abilities have a fresh cipher to decode today. The daily cipher challenge for February 21, 2026, is now available, offering an interactive way for players to…"
    },
    {
      "id": "581",
      "title": "Tapswap Postpones Token Generation Event Due to Market Volatility",
      "url": "/news/581-tapswap-postpones-token-generation-event-due-to-market-volatility/",
      "published_at": "2026-02-21T11:06:22Z",
      "excerpt": "Tapswap has decided to postpone its planned Token Generation Event, citing current market uncertainties as the main reason for the delay. The platform, known for its work in Web3 and crypto-based applications, did not an…"
    },
    {
      "id": "582",
      "title": "Telegram Eyes Expanded Use of TON Blockchain for Tokenized Emojis and Stickers",
      "url": "/news/582-telegram-eyes-expanded-use-of-ton-blockchain-for-tokenized-emojis-and/",
      "published_at": "2026-02-21T08:03:14Z",
      "excerpt": "Telegram has announced plans to deepen its integration with the TON blockchain, with a special focus on bringing tokenized emojis and stickers to its platform. This move signals the messaging service’s continued commitme…"
    },
    {
      "id": "580",
      "title": "AddTon Debuts AddLabs for TON-Based Smart Contract and App Development",
      "url": "/news/580-addton-debuts-addlabs-for-ton-based-smart-contract-and-app-development/",
      "published_at": "2026-02-21T05:02:31Z",
      "excerpt": "AddTon has launched AddLabs, a development platform designed for building smart contracts and applications within the TON ecosystem. This new platform is aimed at both newcomers and experienced developers who want to exp…"
    },
    {
      "id": "577",
      "title": "Toncoin Set for Discussion in Upcoming “Real Talk” Session on 20 February 2026",
      "url": "/news/577-toncoin-set-for-discussion-in-upcoming-real-talk-session-on-20-februar/",
      "published_at": "2026-02-21T02:02:43Z",
      "excerpt": "Toncoin is about to take center stage in an upcoming discussion titled “Real Talk,” scheduled for 20 February 2026. This event is expected to provide insights or analysis related to Toncoin, a digital asset that continue…"
    },
    {
      "id": "569",
      "title": "Toncoin Introduces Fresh AppKit Features Slated for Early May 2026",
      "url": "/news/569-toncoin-introduces-fresh-appkit-features-slated-for-early-may-2026/",
      "published_at": "2026-02-20T14:06:47Z",
      "excerpt": "Toncoin has announced new developments for its AppKit, with a set of updates scheduled to arrive on May 1, 2026. This addition is intended to enhance functionality for both users and developers building on the Toncoin pl…"
    },
    {
      "id": "570",
      "title": "Toncoin Price Forecast Highlights a Potential $30 Target by 2030",
      "url": "/news/570-toncoin-price-forecast-highlights-a-potential-30-target-by-2030/",
      "published_at": "2026-02-20T11:06:48Z",
      "excerpt": "A recent outlook on Toncoin has focused attention on its long-term prospects, with a potential price goal of $30 suggested for the year 2030. The analysis, reportedly by a financial entity, reflects growing curiosity abo…"
    },
    {
      "id": "572",
      "title": "Tomarket Daily Combo Offers Free $TOMA Token Claim on February 20, 2026",
      "url": "/news/572-tomarket-daily-combo-offers-free-toma-token-claim-on-february-20-2026/",
      "published_at": "2026-02-20T08:02:29Z",
      "excerpt": "Tomarket has announced its Daily Combo for February 20, 2026, giving users the opportunity to claim $TOMA tokens for free. This promotion appears to feature instant token distribution, making it an appealing offer for th…"
    },
    {
      "id": "571",
      "title": "Hamster Kombat Daily Combo Offers 5 Million Coins on February 20, 2026",
      "url": "/news/571-hamster-kombat-daily-combo-offers-5-million-coins-on-february-20-2026/",
      "published_at": "2026-02-20T05:02:53Z",
      "excerpt": "Hamster Kombat enthusiasts have something to look forward to on February 20, 2026, as a special in-game event brings a massive pool of 5 million coins up for grabs. Players are reporting heightened activity as they rush…"
    },
    {
      "id": "568",
      "title": "Ton Blockchain Improves AppKit and Announces Toncoin Livestream on February 20",
      "url": "/news/568-ton-blockchain-improves-appkit-and-announces-toncoin-livestream-on-feb/",
      "published_at": "2026-02-20T02:03:35Z",
      "excerpt": "The Ton blockchain ecosystem has rolled out an update to its AppKit, highlighting its ongoing commitment to enhancing developer tools. With this initiative, the platform seeks to streamline the app creation process and i…"
    },
    {
      "id": "565",
      "title": "Reports Suggest Alexei Navalny Was Poisoned With Deadly Frog Toxin",
      "url": "/news/565-reports-suggest-alexei-navalny-was-poisoned-with-deadly-frog-toxin/",
      "published_at": "2026-02-19T14:07:58Z",
      "excerpt": "Questions continue to swirl around the recent death of Russian opposition leader Alexei Navalny, with speculation increasing about how it happened and what exactly caused it. A new analysis by chemical weapons expert Mar…"
    },
    {
      "id": "561",
      "title": "Tomarket Daily Combo Offers Free $TOMA Tokens for February 19, 2026",
      "url": "/news/561-tomarket-daily-combo-offers-free-toma-tokens-for-february-19-2026/",
      "published_at": "2026-02-19T11:02:57Z",
      "excerpt": "Details for the Tomarket Daily Combo promotion on February 19, 2026, have emerged, highlighting an opportunity for participants to claim free $TOMA tokens. The information available points to a special giveaway, but spec…"
    }
  ]
}